app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'dina'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getPost()) {
            $username = $this->request->getVar('username');
            $password = md5($this->request->getVar('password'));

            $dataUser = $this->user->where('username', $username)->first();