app/Controllers/BarangController.php

SELECT *
FROM `detail`
---
    public function index()
    {
        $data['barangs'] = $this->barang->findAll();
        $data['details'] = $this->detail->findAll();