app/Controllers/BarangUserController.php

    public function index()
    {
        $data['details'] = $this->detail->findAll();
---
SELECT *
FROM `detail`

    public function create()
    {
        $data = $this->request->getPost();
        $rules = [
            'nama' => 'required',
            'jumlah' => 'required|integer',
            'keterangan' => 'required',
            'tanggal' => 'required'
        ];
        $validate = $this->validation->setRules($rules)->run($data);

        if ($validate) {
            $userModel = new \App\Models\UserModel();
            $loggedInUsername = session()->get('username');

            // Ambil Username dari UserModel username yang diambil adalah username yang sedang login
            $user = $userModel->where('username', $loggedInUsername)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'humas1'
 LIMIT 1

                    'id_atk' => $lastInsertedId, // ID dari data yang baru saja dimasukkan ke 'atk'
                    'tanggal' => $this->request->getPost('tanggal'),
                ];
                $detailModel->insert($detailData);
---
INSERT INTO `detail` (`id_user`, `id_atk`, `tanggal`) VALUES ('5', 47, '2023-09-17')