app/Controllers/ManajemenUserController.php

SELECT *
FROM `user`
---
    public function index()
    {
        $data['manajemenusers'] = $this->manajemenuser->findAll();